Revit 2026 API

# MEPSystemIsEmpty Property

---

Indicates if the system is empty or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEmpty { get; }
```
```vb
Public ReadOnly Property IsEmpty As Boolean
	Get
```
```cpp
public:
property bool IsEmpty {
	bool get ();
}
```
```fsharp
member IsEmpty : bool with get
```

#### Property Value

Boolean

returns true if the system doesn't contain any components

#### Reference

MEPSystem Class

Autodesk.Revit.DB Namespace